Tekla Open API Reference for Tekla Structures 2025
Model.GetModelObjectSelector Method
 Returns a ModelObjectSelector instance from which different kind of selections can be made.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectSelector GetModelObjectSelector()
Public Function GetModelObjectSelector As ModelObjectSelector
Return Value
Type: ModelObjectSelector
A new ModelObjectSelector instance.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace